In [1]:
import numpy as np
import pandas as pd

In [5]:
df = pd.DataFrame({'k1': ['X','X','Y','Y','Z'],
                  'k2':['alpha','beta','alpha','beta','alpha'],
                       'dataset1':np.random.randn(5),
                       'dataset2':np.random.randn(5)})

In [6]:
df

   dataset1  dataset2 k1     k2
0  0.759588 -0.069562  X  alpha
1  0.570083 -2.633492  X   beta
2  0.570387  0.499777  Y  alpha
3  0.881756  1.668146  Y   beta
4 -0.639340 -0.730631  Z  alpha

In [7]:
# group by k1
group1 = df.dataset1.groupby(df.k1)

In [8]:
group1

In [9]:
group1.mean()

k1
X    0.664835
Y    0.726072
Z   -0.639340
Name: dataset1, dtype: float64

In [10]:
df['city'] = np.array(['NY','La','La','NY','NY'])

In [12]:
df['month'] = np.array(['Oct','Jun','Jan','Feb','Sep'])

In [13]:
df

   dataset1  dataset2 k1     k2 city month
0  0.759588 -0.069562  X  alpha   NY   Oct
1  0.570083 -2.633492  X   beta   La   Jun
2  0.570387  0.499777  Y  alpha   La   Jan
3  0.881756  1.668146  Y   beta   NY   Feb
4 -0.639340 -0.730631  Z  alpha   NY   Sep

In [21]:
df.dataset1.groupby([df.city,df.month]).mean()

city  month
La    Jan      0.570387
      Jun      0.570083
NY    Feb      0.881756
      Oct      0.759588
      Sep     -0.639340
Name: dataset1, dtype: float64

In [23]:
df.drop(['city','month'],axis=1)

   dataset1  dataset2 k1     k2
0  0.759588 -0.069562  X  alpha
1  0.570083 -2.633492  X   beta
2  0.570387  0.499777  Y  alpha
3  0.881756  1.668146  Y   beta
4 -0.639340 -0.730631  Z  alpha

In [25]:
# pass column names as group keys
df.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.664835 -1.351527
Y   0.726072  1.083962
Z  -0.639340 -0.730631

In [26]:
# multiple column names
df.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.759588 -0.069562
   beta   0.570083 -2.633492
Y  alpha  0.570387  0.499777
   beta   0.881756  1.668146
Z  alpha -0.639340 -0.730631

In [27]:
# size 
df.groupby('k1').size()

k1
X    2
Y    2
Z    1
dtype: int64

In [28]:
df.groupby('k1')

In [29]:
# iterate over groups
for name,group in df.groupby('k1'):
    print("THis is the %s group" %name)
    print(group)
    print('\n')

THis is the X group
   dataset1  dataset2 k1     k2 city month
0  0.759588 -0.069562  X  alpha   NY   Oct
1  0.570083 -2.633492  X   beta   La   Jun


THis is the Y group
   dataset1  dataset2 k1     k2 city month
2  0.570387  0.499777  Y  alpha   La   Jan
3  0.881756  1.668146  Y   beta   NY   Feb


THis is the Z group
   dataset1  dataset2 k1     k2 city month
4  -0.63934 -0.730631  Z  alpha   NY   Sep

In [30]:
df.groupby(['k1','k2'])

In [31]:
for (k1,k2), group in df.groupby(['k1','k2']):
    print("key1 = %s and Key2 = %s" %(k1,k2))
    print(group)
    print('\n')

key1 = X and Key2 = alpha
   dataset1  dataset2 k1     k2 city month
0  0.759588 -0.069562  X  alpha   NY   Oct


key1 = X and Key2 = beta
   dataset1  dataset2 k1    k2 city month
1  0.570083 -2.633492  X  beta   La   Jun


key1 = Y and Key2 = alpha
   dataset1  dataset2 k1     k2 city month
2  0.570387  0.499777  Y  alpha   La   Jan


key1 = Y and Key2 = beta
   dataset1  dataset2 k1    k2 city month
3  0.881756  1.668146  Y  beta   NY   Feb


key1 = Z and Key2 = alpha
   dataset1  dataset2 k1     k2 city month
4  -0.63934 -0.730631  Z  alpha   NY   Sep

In [35]:
# use a dictionary to save the data pieces
group_dict = dict(list(df.groupby('k1'))) #dictionary's key is the group name X: Y: Z:

In [36]:
group_dict['X'] # specify the key: x,y,z

   dataset1  dataset2 k1     k2 city month
0  0.759588 -0.069562  X  alpha   NY   Oct
1  0.570083 -2.633492  X   beta   La   Jun